INSERT INTO `task_type` VALUES
(1,'ゲーム','game'),
(2,'マンガ','manga'),
(3,'アニメ','anime'),
(4,'音楽','music'),
(5,'社会','socierty'),
(6,'芸能','geinou');

INSERT INTO `task` VALUES
(NULL,1,1,'板チョコの溝は何のため？','多くの人は板チョコを割りやすくするために溝をつけていると思っていますが、実はそうではありません。板チョコの溝はチョコレートを冷やし固める際を考慮してつけられているものなんです。理科の授業で習ったかと思いますが、物質の表面積が広ければ広いほど冷たさなどの温度をその物質に効率よ伝えることが出来ます。作られたばかりのチョコレートは当然ですが熱によってドロドロとした液体となっていて、その状態から冷やして固体にする必要があります。この時に溝がついていないと冷気が効率よく板チョコに伝わらないため、チョコレートを固めるのに時間がかかってしまいます。あえて溝をつけることによって板チョコの表面積を広くして効率よく冷やし固めて、短時間で大量の板チョコを製造出来るようにしているのでした。','2020-07-07 15:00:00'),
(NULL,1,5,'真実？子ども達をビビらせる「コーラで骨が溶ける」の噂','結論から言ってしまうと、コーラが歯や骨を溶かすという情報は「本当」です。人間の歯や骨は主にカルシウムやマグネシウムから出来ており、カルシウムやマグネシウムは酸に反応して溶ける性質を持っています。そして、コーラには酸味料が含まれていて酸性の飲み物であることから、歯や骨を溶かしてしまうのです。また、コーラに限らず酸味料などが含まれた酸性の清涼飲料水は、例外なく歯や骨を溶かす性質を持っています。実際に実験してみると、食べ終わった魚の骨や抜けた自分の歯をコーラに長時間浸しておくと、溶けてしまうことがわかります。','2020-09-13 17:00:00'),
(NULL,1,3,'「オッス、オラ悟空」に隠された秘密','ドラゴンボールの悟空といえば、「オッス、オラ悟空」というセリフが有名である。だが、悟空は本編で一度も「オッス、オラ悟空」といったことがない。「オッス、オラ悟空」といっていたのはアニメの次回予告や、超武闘伝（ゲーム）のときだけなのだ。','2020-09-13 17:00:00'),
(NULL,1,1,'ドンキーコング(FC)に関する豆知識','マリオが初めて助けたヒロインは、ピーチ姫、ではない。「ドンキーコング」で助けたレディ(現在のポリーン)が最初のヒロン。','2020-09-13 17:00:00'),
(NULL,1,4,'イエスタディ','テレビで、ポール・マッカートニーについての番組で見たのですが、イエスタディは、ポール・マッカートニーが夢で聴いた音楽に、ジョン・レノンが歌詞をつけたものらしいです。ポール・マッカートニーは、夢で聴いた曲が、あまりにも良くできていたので、元々知っている曲が夢の中に出てきたのだと思い、周囲の色々な人に、確認したのですが、誰もその曲を知っている人がいなかったということでした。','2020-09-14 17:00:00'),
(NULL,1,4,'白黒が反転したピアノの鍵盤','博物館などにいくと、白黒の部分が逆になっているピアノ（正確に言うと、ピアノ以前のチェンバロなどの楽器）を見ることがあります。なぜ、白黒が逆だったかということについて面白い話を見つけました。バロック音楽の時代は、鍵盤の白い部分は、象牙が使われいたそうです。象牙は高価ですから、面積の狭いほう（今の鍵盤の黒鍵の部分）に使用されていたそうです。また、女性の白い指を際立たせるためにも、面積の広いほう（今の白鍵の部分）が黒くなっていたそうです。しかし、楽器がインテリアとしての意味をもつようになり、豪華にしようとする意図から、象牙を使用する白い部分が、面積の広いほうになったということです。','2020-09-14 17:01:00'),
(NULL,1,2,'花沢さんは原作に出てこない','最近は携帯電話が使われたり、部屋に韓流アイドルのポスターが貼られたりするようになった長寿アニメ『サザエさん』。実は花沢さんをはじめ、カツオとワカメのクラスメート・教師の大は原作漫画に登場しない。ほかに名脇役のアナゴ君、1980年代まで礒野家の隣に住んでいた浜さん一家などもアニメ限定キャラクターだ。現在の隣人、伊佐坂ファミリーは原作で一度登場しいる。','2020-09-14 17:02:00'),
(NULL,1,2,'ジャムおじさん・バタコさんは人間じゃなかった','『それいけ!アンパンマン』の人気キャラクターであるジャムおじさんとバタコさん。アニメ版では公式に人間だと設定されているのだが、過去に発売された研究本によれば、原作者の漫家やなせたかし氏が「妖精に近い存在」と語っている。主要なパン型ヒーローのうち“しょくぱんまん”だけ他の2人（アンパンマン、カレーパンマン）と出自が違っていたり、実は犬のチーズは葉をしゃべれる設定だったり、調べれば『アンパンマン』には興味深い話が少なくない。なおアニメ版はキャラクター数の多さでギネス認定されたという意外な記録も持っている。','2020-09-14 17:03:10'),
(NULL,1,6,'お笑いタレントのギャグにも著作権は存在するのか','志村けんの「アイーン」や小島よしおの「オッパッピー」、オードリー春日の「テュース」など、お笑い界には、一世を風靡したギャグが少なくありませんが、こうしたギャグを考案者以外のタレントが使うことは許されるのでしょうか？「著作権法」では、その対象となるものについて、「文芸や学術、美術、または音楽の範囲に属する」著作物と、「著作物を演じ、舞い、演奏し、歌いといった方法で演ずること」、または著作物を演じないが芸能的な性質を有するもの」と規定しています。お笑いタレントのギャグはというと、後者の「著作物を演じないが芸能的な性質を有するもの」にあたります。というわけで、ギャグにもちゃんと著作権があるのです。','2020-09-14 17:03:00');

INSERT INTO `authority` VALUES
('USER', 10),
('STAFF', 20),
('ADMIN', 30);

INSERT INTO `user` VALUES
(NULL, 'ユーザー1', 'user1@example.com', 'pass1', '1', 'USER', 'key1'),
(NULL, 'ユーザー2', 'user2@example.com', 'pass2', '0', 'USER', 'key2'),
(NULL, 'ユーザー3', 'user3@example.com', 'pass3', '1', 'USER', 'key3'),
(NULL, 'ユーザー4', 'user4@example.com', 'pass4', '1', 'ADMIN', 'key4');

insert into issues(summary, description) values('板チョコの溝は何のため？','多くの人は板チョコを割りやすくするために溝をつけていると思っていますが、実はそうではありません。板チョコの溝はチョコレートを冷やし固める際を考慮してつけられているものなんです。理科の授業で習ったかと思いますが、物質の表面積が広ければ広いほど冷たさなどの温度をその物質に効率よ伝えることが出来ます。作られたばかりのチョコレートは当然ですが熱によってドロドロとした液体となっていて、その状態から冷やして固体にする必要があります。この時に溝がついていないと冷気が効率よく板チョコに伝わらないため、チョコレートを固めるのに時間がかかってしまいます。あえて溝をつけることによって板チョコの表面積を広くして効率よく冷やし固めて、短時間で大量の板チョコを製造出来るようにしているのでした。');
insert into issues(summary, description) values('真実？子ども達をビビらせる「コーラで骨が溶ける」の噂','結論から言ってしまうと、コーラが歯や骨を溶かすという情報は「本当」です。人間の歯や骨は主にカルシウムやマグネシウムから出来ており、カルシウムやマグネシウムは酸に反応して溶ける性質を持っています。そして、コーラには酸味料が含まれていて酸性の飲み物であることから、歯や骨を溶かしてしまうのです。また、コーラに限らず酸味料などが含まれた酸性の清涼飲料水は、例外なく歯や骨を溶かす性質を持っています。実際に実験してみると、食べ終わった魚の骨や抜けた自分の歯をコーラに長時間浸しておくと、溶けてしまうことがわかります。');
insert into issues(summary, description) values('「オッス、オラ悟空」に隠された秘密','ドラゴンボールの悟空といえば、「オッス、オラ悟空」というセリフが有名である。だが、悟空は本編で一度も「オッス、オラ悟空」といったことがない。「オッス、オラ悟空」といっていたのはアニメの次回予告や、超武闘伝（ゲーム）のときだけなのだ。');
insert into issues(summary, description) values('ドンキーコング(FC)に関する豆知識','マリオが初めて助けたヒロインは、ピーチ姫、ではない。「ドンキーコング」で助けたレディ(現在のポリーン)が最初のヒロン。');
insert into issues(summary, description) values('お笑いタレントのギャグにも著作権は存在するのか','志村けんの「アイーン」や小島よしおの「オッパッピー」、オードリー春日の「テュース」など、お笑い界には、一世を風靡したギャグが少なくありませんが、こうしたギャグを考案者以外のタレントが使うことは許されるのでしょうか？「著作権法」では、その対象となるものについて、「文芸や学術、美術、または音楽の範囲に属する」著作物と、「著作物を演じ、舞い、演奏し、歌いといった方法で演ずること」、または著作物を演じないが芸能的な性質を有するもの」と規定しています。お笑いタレントのギャグはというと、後者の「著作物を演じないが芸能的な性質を有するもの」にあたります。というわけで、ギャグにもちゃんと著作権があるのです。');

